use crate::{Context, Error};

#[poise::command(slash_command)]
async fn ru_interface(ctx: Context<'_>) -> Result<(), Error> {
    ctx.say(
        r#"
# Російськомовний інтерфейс

Розробники ПО та ігор послуговуються статистикою щодо використання мов інтерфейсу і приймають рішення в тому числі базуючись на ній щодо локалізації ігор та доступності мов. В тому числі і українські студії.

Наприклад, [таку статистику пропонує Steam](https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam) (секція "Language").

Регіональний поділ аудиторії відбувається в тому числі за мовою: доходило до того, що деякі ігри Ubisoft та EA певний час були недоступні англійською для України. А в Lost Ark та деяких інших ММО нас взагалі насильно загнали в ру регіон без права вибору.

Купа ігор доступні українською завдяки нашим перекладачам-волонтерам, які на то витрачають купу власного часу. Kingdom Come: Deliverance, Satisfactory, Deep Rock Galactic, Factorio. Такі ініціативи варто підтримувати. Деякі ігри ААА класу мають повноцінну офіційну україномовну локалізацію: Cyberpunk 2077, Baldurs Gate 3, серія ігор S.T.A.L.K.E.R та серія ігор Metro. І найкраща їх підтримка - грати українською. Зіграйте, не пошкодуєте!

Зі зростанням кількості користувачів україномовного інтерфейсу зростатимуть, відповідно, кількість і якість локалізацій. Й тим швидше вони з'являтимуться. Можливо, з часом, навіть на релізі!

**Споживаймо відповідально!**
        "#
        .trim(),
    )
    .await?;
    Ok(())
}

#[poise::command(slash_command)]
async fn apolitical(ctx: Context<'_>) -> Result<(), Error> {
    ctx.say(
        r#"
# Поза політикою

Політика - це діяльність, спрямована на управління державою. Законодавство - це політика. Закони визначають правила нашого з вами життя та взаємодії в суспільстві. А тому політика - це все. Медицина, освіта, ціна ковбаси в магазині чи роздовбана дорога - це політика. Ваше авто, чай на сніданок і хліб з маслом - це політика. Ваш (не)спокійний сон та вибухи за вікном - теж політика. Спорт в будь-яких його проявах - теж політика, як частина суспільного життя. Від політики нікуди не дітися і не сховатися, вона всюди.

Тому сентенції на кшталт "ігри поза політикою" чи "спорт поза політикою" щонайменше неправдиві. Щонайбільше - небезпечні. Люди, що позиціонують себе "поза політикою", свідомо відмовляються від відповідальності за власне життя і майбутнє, віддаючи його в руки тих, хто "в політиці". Вибір за вас зробить інший, а з наслідками цього вибору доведеться жити вам.

Тому політика - це важливо. Брати в ній участь і впливати на суспільні процеси - теж важливо. Писати листи, запити, вимагати дотримання своїх прав і свобод. Джерелом влади в Україні є народ. Суспільний запит визначає курс держави. І починається з окремих людей та простих дій.
        "#
        .trim(),
    )
    .await?;
    Ok(())
}

#[poise::command(slash_command)]
async fn russians(ctx: Context<'_>) -> Result<(), Error> {
    ctx.say(
        r#"
# Чому росіян варто називати росіянами?

Навішуючи ярлики типу "орки" чи "свинособаки" ми свідомо дистанціюємо ті звірства що вони роблять від них самих. Відокремлюємо росіян від їх злочинів, приписуючи це міфічним "оркам". В своїй свідомости та в свідомості суспільств за кордоном. Це як підміняти війну словосполученням "Спеціяльна Військова Операція". Не варто. Воюють проти нас, насилують та вбивають реальні люди, громадяни росії, себто росіяни. Так, це звучить некомфортно в порівнянні з "орками", але тут краще дивитися правді у вічі і називати речі своїми іменами.
        "#
        .trim(),
    )
    .await?;
    Ok(())
}

#[poise::command(slash_command)]
async fn russian_spoiler(ctx: Context<'_>) -> Result<(), Error> {
    ctx.say(
        r#"
# Чому весь російськомовний контент варто заганяти під спойлер?

оМова - це, в тому числі, зброя. Зброя потужна. Така, що нищить в тилу без всяких ракет та артилерії. Російську мову використовують проти нас відповідно. Там де є російська, себто в російськомовному інфопросторі - шанс натрапити на наративи вигідні РФ значно вищий. Чим більше ми послуговуємося російською - говоримо, читаємо, дивимось, ділимось - тим вразливіші ми для цієї зброї, як нація. Сьогодні смішний відосик російською, завтра стаття, післязавтра аналітика, а за кілька років - російські новини. Повзуча культурна окупація відбувається не перше десятиліття. Озирніться навколо. Навіщо спрощувати ворогу його задачу?
        "#
        .trim(),
    )
    .await?;
    Ok(())
}

#[poise::command(slash_command)]
async fn russian_games(ctx: Context<'_>) -> Result<(), Error> {
    ctx.say(
        r#"
# Чому не варто грати в ігри від російських розробників та видавців?

Навіть граючи в гру безкоштовно, ти платиш власним часом та самою своєю присутністю:
* Просуваєш гру в рейтингах того ж стіма.
* Тягнеш російський вміст і наратив в український інфопростір: її видно в тебе в статусі, ти так чи інакше обговорюєш її з друзями.
* Створюєш вміст в грі для інших гравців, завдяки тобі їм є з ким грати і за що платити гроші.
* Граючи з України в російський проєкт з росіянами, підтримуєш наратив "мишебраттів".

Тобто, робиш грі вміст, рекламу і прибуток навіть не вносячи грошей напряму. І, тим самим, спонсоруєш ті ракети які потім летять по українських містах.
        "#
        .trim(),
    )
    .await?;
    Ok(())
}

#[poise::command(slash_command)]
async fn ukrainian_enhanced_kb_layout(ctx: Context<'_>) -> Result<(), Error> {
    ctx.say(
        r#"
# Розширена українська розкладка клавіатури

Для тих, кому доводиться, час від часу, набирати відсутні в українському алфавіті літери слов'янських мов, але не хочеться ставити інші розкладки.

https://oleksiyrudenko.github.io/Ukrainian-Enhanced-Keyboard-WIndows/
        "#
        .trim(),
    )
    .await?;
    Ok(())
}

#[poise::command(
    slash_command,
    subcommands(
        "ru_interface",
        "apolitical",
        "russians",
        "russian_spoiler",
        "russian_games",
        "ukrainian_enhanced_kb_layout"
    )
)]
pub async fn faq(ctx: Context<'_>) -> Result<(), Error> {
    ctx.reply("n/a").await?;
    Ok(())
}
